In [1]:
import numpy as np
import pandas as pd

# CSV

Başka uygulamalarda,bilgisayarlar da vs aynı veriyi alırız.

1. Veriler ne ile ayrılmış?(Virgül,tab,boşluk vs)
2. Ondalık sayı aracı nedir?(desimal)(Türkiye'de virgül.Uluslararası nokta.)
3. Veri setinde bilgi satırı var mı?(Sütun adı var mı yok mu?)
4. İndeks sütunu var mı?(Her veriye tanımlı id var mı?(örn. Tc Kimlik No,Tarih))

In [2]:
# (ayrıcı=',' ondalık='.')
df = pd.read_csv("../data/employees.csv",sep=',',decimal='.')

In [3]:
# ilk 5 satır
df.head(5)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

# Series(Seriler)

In [4]:
seri_ornegi = pd.Series([1,2,3,5,8]) # Seriler tek boyutlu diziler gibi.

In [5]:
seri_ornegi

0    1
1    2
2    3
3    5
4    8
dtype: int64

In [6]:
seri_ornegi.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
# Sadece değerler
seri_ornegi.values

array([1, 2, 3, 5, 8])

## Seride dilimleme indeksleme

In [8]:
# indexi 1 olan 2 olan ve 3 olmayan 
seri_ornegi[1:3]

1    2
2    3
dtype: int64

In [9]:
df2 = pd.DataFrame(np.random.rand(3,2), 
                   columns=['sütun 1','sütun 2'], 
                   index = ['a','b','c'])
df2

    sütun 1   sütun 2
a  0.437265  0.212706
b  0.369069  0.010111
c  0.918622  0.878102

In [10]:
# plaka_kodlari = {key:value}
plaka_kodlari = {'Istanbul':'34', 'Sakarya':'54', 'Kahramanmaraş':'46'}
nüfus_sayilari = {'Istanbul':2000000, 
                  'Sakarya':100000, 
                  'Kahramanmaraş':150000}
sehirler = pd.DataFrame({'plakalar':plaka_kodlari,'nüfus':nüfus_sayilari})

In [11]:
sehirler

              plakalar    nüfus
Istanbul            34  2000000
Sakarya             54   100000
Kahramanmaraş       46   150000

In [12]:
sehirler.index

Index(['Istanbul', 'Sakarya', 'Kahramanmaraş'], dtype='object')

In [13]:
type(sehirler.index)

pandas.core.indexes.base.Index

In [14]:
# Tablo kıyaslamalarını indeksler üzerinden yapılabilir
indeksler = pd.Index([1,2,3])

In [15]:
# indeksler değiştirilemez.
indeksler[1]

2

In [16]:
indeks_1 = pd.Index([1,2,3,4,5])
indeks_2 = pd.Index([2,4,6])

In [17]:
indeks_1

Index([1, 2, 3, 4, 5], dtype='int64')

In [18]:
set(indeks_1)

{1, 2, 3, 4, 5}

In [19]:
ortak_eleman = set(indeks_1) & set(indeks_2)
ortak_eleman

{2, 4}

In [20]:
birlesim_kumesi = set(indeks_1) | set(indeks_2)
birlesim_kumesi

{1, 2, 3, 4, 5, 6}

In [21]:
farklari = set(indeks_1) ^ set(indeks_2)
farklari

{1, 3, 5, 6}

In [22]:
# 2 satır olan 2'ye 3'lük matris
dizi = np.array([[2,3,4],[4,5,0]])
dizi

array([[2, 3, 4],
       [4, 5, 0]])

In [23]:
dizi[1,2]

0

In [24]:
df2

    sütun 1   sütun 2
a  0.437265  0.212706
b  0.369069  0.010111
c  0.918622  0.878102

## Loc ve Iloc

In [25]:
df2.loc['a','sütun 1']

0.4372646326562696

In [26]:
# 1. veriyi getir
df2.iloc[1]

sütun 1    0.369069
sütun 2    0.010111
Name: b, dtype: float64

In [27]:
df2.iloc[1:3,0:1]

    sütun 1
b  0.369069
c  0.918622

## Temel Tanımlayıcı İstatistikler

In [28]:
# Tanımlayıcı İstatistik bilgisi
df.describe()

              Salary      Bonus %
count    1000.000000  1000.000000
mean    90662.181000    10.207555
std     32923.693342     5.528481
min     35013.000000     1.015000
25%     62613.000000     5.401750
50%     90428.000000     9.838500
75%    118740.250000    14.838000
max    149908.000000    19.944000

In [29]:
df2['sütun 1'].min()

0.3690690364353576

## Eksik Veriler

1. None
2. Null
3. Nan(Not a Number)

In [30]:
degerler = np.array([1,2,None,5,2])

In [31]:
type(degerler[2])

NoneType

In [32]:
degerler2 = np.array([1,2,np.nan,2])

In [33]:
degerler2.sum()

nan

## Eksik Veri Komutları

1. inull():Eksik değerler için True döndürür.
2. notnull(): isnull tersi.
3. dropna(): Eksik verileri kaldır.
4. fillna(): Eksik verileri doldur.

In [34]:
data = pd.Series([1,np.nan,'merhaba',None])

In [35]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [36]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [37]:
# Sadece True verileri getirir. (Eksik olmayan veriler.)
data[data.notnull()]

0          1
2    merhaba
dtype: object

In [38]:
# Eksik olan verileri düşürür.
data.dropna()

0          1
2    merhaba
dtype: object

In [39]:
# Veriyi kalıcı olarak boşları atarak değiştirir.
# Karışmaması için veri adı da değiştirilirse daha sağlıklı olur.
data.dropna(inplace=True)

In [40]:
data

0          1
2    merhaba
dtype: object

In [41]:
df3 = pd.DataFrame([[1,np.nan,2],[3,4,5],[np.nan,4,6]])

In [42]:
df3

     0    1  2
0  1.0  NaN  2
1  3.0  4.0  5
2  NaN  4.0  6

In [43]:
# Nan olan sütunları düşürdü.
# df3.dropna()

In [44]:
# df3.dropna(axis='columns')

In [45]:
# df3.dropna(axis='rows')

In [46]:
df3.iloc[0,1] = 4

In [47]:
df3

     0    1  2
0  1.0  4.0  2
1  3.0  4.0  5
2  NaN  4.0  6

In [48]:
df3.fillna(0)

     0    1  2
0  1.0  4.0  2
1  3.0  4.0  5
2  0.0  4.0  6

In [49]:
#Bir sonrakiyle değiştirme.
# df3.fillna(method='bfill)

In [50]:
#Bir öncekiyle değiştirme.
# df3.fillna(method='bffill)

In [51]:
# Bir öncekine bakma.
# df3.fillna(method='bffill, axis=1)

# Groupby

In [52]:
df.groupby(by='Team').sum()['Salary']

Team
Business Development    9278498
Client Services         9351789
Distribution            7965042
Engineering             8672766
Finance                 9406387
Human Resources         8275952
Legal                   7858718
Marketing               8862688
Product                 8423223
Sales                   8664303
Name: Salary, dtype: int64

## Pivot Tablo

In [53]:
dogumlar = pd.read_csv('../data/births.csv')

In [54]:
dogumlar

       year  month  day gender  births
0      1969      1  1.0      F    4046
1      1969      1  1.0      M    4440
2      1969      1  2.0      F    4454
3      1969      1  2.0      M    4548
4      1969      1  3.0      F    4548
...     ...    ...  ...    ...     ...
15542  2008     10  NaN      M  183219
15543  2008     11  NaN      F  158939
15544  2008     11  NaN      M  165468
15545  2008     12  NaN      F  173215
15546  2008     12  NaN      M  181235

[15547 rows x 5 columns]

In [55]:
dogumlar.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [56]:
dogumlar.groupby(by='gender').sum()['births']

gender
F    74035823
M    77738555
Name: births, dtype: int64

In [57]:
dogumlar.pivot_table('births',index='gender',columns='month')

month,1,2,3,4,5,6,7,8,9,10,11,12
gender,,,,,,,,,,,,
F,9242.644717,9057.980707,9437.577099,9130.767442,9396.308869,9475.934681,9957.643731,10092.848624,10035.703876,9709.430982,9234.710078,9455.892966
M,9691.807044,9558.436893,9919.436641,9651.940810,9953.588326,9965.959690,10482.044343,10576.006107,10544.015552,10098.172256,9676.866667,9897.188073